Revit 2026 API
RebarContainerItem.SetFromCurves Method
Overload List
Name | Description
SetFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | Obsolete.
SetFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList<Curve>, RebarTerminationOrientation, RebarTerminationOrientation, Boolean, Boolean)
Top
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace